In [2]:
import numpy as np
import pandas as pd

In [3]:
pd.set_option('display.max_columns', 50)
pd.set_option('display.width', 100)
pd.set_option('display.max_colwidth', 250)

## pandas 데이터프레임 살펴보기
* head, tail
* info, shape, ndim, dtypes
* describe, count, value_counts
* sum, mean, median, min, max, std, corr

In [6]:
emp = pd.read_csv('./data/employees.csv')
emp.index = np.arange(1, len(emp.EMAIL)+1)

In [8]:
# 상위 5개 행 출력
emp.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
1,100,Steven,King,SKING,515.123.4567,2003-06-17,AD_PRES,24000.0,NaN,NaN,90.0
2,101,Neena,Kochhar,NKOCHHAR,515.123.4568,2005-09-21,AD_VP,17000.0,NaN,100.0,90.0
3,102,Lex,De Haan,LDEHAAN,515.123.4569,2001-01-13,AD_VP,17000.0,NaN,100.0,90.0
4,103,Alexander,Hunold,AHUNOLD,590.423.4567,2006-01-03,IT_PROG,9000.0,NaN,102.0,60.0
5,104,Bruce,Ernst,BERNST,590.423.4568,2007-05-21,IT_PROG,6000.0,NaN,103.0,60.0

In [9]:
# 하위 5개 행 출력
emp.tail()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
103,202,Pat,Fay,PFAY,603.123.6666,2005-08-17,MK_REP,6000.0,NaN,201.0,20.0
104,203,Susan,Mavris,SMAVRIS,515.123.7777,2002-06-07,HR_REP,6500.0,NaN,101.0,40.0
105,204,Hermann,Baer,HBAER,515.123.8888,2002-06-07,PR_REP,10000.0,NaN,101.0,70.0
106,205,Shelley,Higgins,SHIGGINS,515.123.8080,2002-06-07,AC_MGR,12008.0,NaN,101.0,110.0
107,206,William,Gietz,WGIETZ,515.123.8181,2002-06-07,AC_ACCOUNT,8300.0,NaN,205.0,110.0

In [10]:
emp.shape, emp.ndim, emp.dtypes

((107, 11),
 2,
 EMPLOYEE_ID         int64
 FIRST_NAME         object
 LAST_NAME          object
 EMAIL              object
 PHONE_NUMBER       object
 HIRE_DATE          object
 JOB_ID             object
 SALARY            float64
 COMMISSION_PCT    float64
 MANAGER_ID        float64
 DEPARTMENT_ID     float64
 dtype: object)

In [11]:
# 데이터프레임의 전반적인 정보 출력
emp.info()

<class 'pandas.core.frame.DataFrame'>
Index: 107 entries, 1 to 107
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   EMPLOYEE_ID     107 non-null    int64
 1   FIRST_NAME      107 non-null    object
 2   LAST_NAME       107 non-null    object
 3   EMAIL           107 non-null    object
 4   PHONE_NUMBER    107 non-null    object
 5   HIRE_DATE       107 non-null    object
 6   JOB_ID          107 non-null    object
 7   SALARY          107 non-null    float64
 8   COMMISSION_PCT  35 non-null     float64
 9   MANAGER_ID      106 non-null    float64
 10  DEPARTMENT_ID   106 non-null    float64
dtypes: float64(4), int64(1), object(6)
memory usage: 10.0+ KB

In [13]:
# 데이터프레임의 요약 정보 출력 (단, 숫자 컬럼 대상)
emp.describe()

       EMPLOYEE_ID        SALARY  COMMISSION_PCT  MANAGER_ID  DEPARTMENT_ID
count   107.000000    107.000000       35.000000  106.000000     106.000000
mean    153.000000   6461.831776        0.222857  124.764151      63.207547
std      31.032241   3909.579731        0.085184   20.315395      20.910110
min     100.000000   2100.000000        0.100000  100.000000      10.000000
25%     126.500000   3100.000000        0.150000  108.000000      50.000000
50%     153.000000   6200.000000        0.200000  122.000000      50.000000
75%     179.500000   8900.000000        0.300000  145.000000      80.000000
max     206.000000  24000.000000        0.400000  205.000000     110.000000

In [14]:
# 데이터 건수 출력
emp.count()

EMPLOYEE_ID       107
FIRST_NAME        107
LAST_NAME         107
EMAIL             107
PHONE_NUMBER      107
HIRE_DATE         107
JOB_ID            107
SALARY            107
COMMISSION_PCT     35
MANAGER_ID        106
DEPARTMENT_ID     106
dtype: int64

In [21]:
# 명목형 데이터에 대한 건수 출력
emp.JOB_ID.value_counts()

JOB_ID
SA_REP        30
ST_CLERK      20
SH_CLERK      20
SA_MAN         5
IT_PROG        5
FI_ACCOUNT     5
PU_CLERK       5
ST_MAN         5
AD_VP          2
MK_REP         1
AC_MGR         1
PR_REP         1
HR_REP         1
AD_PRES        1
MK_MAN         1
AD_ASST        1
PU_MAN         1
FI_MGR         1
AC_ACCOUNT     1
Name: count, dtype: int64

In [22]:
emp.MANAGER_ID.value_counts()

MANAGER_ID
100.0    14
120.0     8
124.0     8
122.0     8
121.0     8
123.0     8
145.0     6
146.0     6
147.0     6
148.0     6
149.0     6
114.0     5
108.0     5
101.0     5
103.0     4
102.0     1
201.0     1
205.0     1
Name: count, dtype: int64

In [23]:
emp.DEPARTMENT_ID.value_counts()

DEPARTMENT_ID
50.0     45
80.0     34
100.0     6
30.0      6
60.0      5
90.0      3
20.0      2
110.0     2
10.0      1
40.0      1
70.0      1
Name: count, dtype: int64

In [24]:
# 각종 통계 함수들
emp.SALARY.sum(), emp.SALARY.mean(), emp.SALARY.median()

(691416.0, 6461.8317757009345, 6200.0)

In [25]:
emp.SALARY.min(), emp.SALARY.max(), emp.SALARY.std()

(2100.0, 24000.0, 3909.5797305524825)

In [43]:
#### summermedal 데이터에 대한 간단한 정보 확인
medal = pd.read_csv('./data/summermedals.csv')
medal.index = np.arange(1, len(medal.Year)+1)
medal.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
1,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
2,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
3,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
4,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
5,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [44]:
medal.info()

<class 'pandas.core.frame.DataFrame'>
Index: 31165 entries, 1 to 31165
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        31165 non-null  int64
 1   City        31165 non-null  object
 2   Sport       31165 non-null  object
 3   Discipline  31165 non-null  object
 4   Athlete     31165 non-null  object
 5   Country     31161 non-null  object
 6   Gender      31165 non-null  object
 7   Event       31165 non-null  object
 8   Medal       31165 non-null  object
dtypes: int64(1), object(8)
memory usage: 2.4+ MB

In [32]:
# 데이터 건수 출력
medal.count()

Year          31165
City          31165
Sport         31165
Discipline    31165
Athlete       31165
Country       31161
Gender        31165
Event         31165
Medal         31165
dtype: int64

In [34]:
# 명목형 데이터에 대한 건수 출력
medal.Year.value_counts()

Year
2008    2042
2000    2015
2004    1998
2012    1949
1996    1859
1992    1705
1988    1546
1984    1459
1980    1387
1976    1305
1920    1298
1972    1185
1968    1031
1964    1010
1952     889
1912     885
1956     885
1924     884
1960     882
1936     875
1948     814
1908     804
1928     710
1932     615
1900     512
1904     470
1896     151
Name: count, dtype: int64

In [33]:
medal.City.value_counts()

City
London                   3567
Athens                   2149
Los Angeles              2074
Beijing                  2042
Sydney                   2015
Atlanta                  1859
Barcelona                1705
Seoul                    1546
Paris                    1396
Moscow                   1387
Montreal                 1305
Antwerp                  1298
Munich                   1185
Mexico                   1031
Tokyo                    1010
Helsinki                  889
Stockholm                 885
Melbourne / Stockholm     885
Rome                      882
Berlin                    875
Amsterdam                 710
St Louis                  470
Name: count, dtype: int64

In [46]:
medal.loc[:, ['Year', 'City']].value_counts()

Year  City
2008  Beijing                  2042
2000  Sydney                   2015
2004  Athens                   1998
2012  London                   1949
1996  Atlanta                  1859
1992  Barcelona                1705
1988  Seoul                    1546
1984  Los Angeles              1459
1980  Moscow                   1387
1976  Montreal                 1305
1920  Antwerp                  1298
1972  Munich                   1185
1968  Mexico                   1031
1964  Tokyo                    1010
1952  Helsinki                  889
1912  Stockholm                 885
1956  Melbourne / Stockholm     885
1924  Paris                     884
1960  Rome                      882
1936  Berlin                    875
1948  London                    814
1908  London                    804
1928  Amsterdam                 710
1932  Los Angeles               615
1900  Paris                     512
1904  St Louis                  470
1896  Athens                    151
Name: count, dtype: int64

In [35]:
medal.Country.value_counts()

Country
USA    4585
URS    2049
GBR    1720
FRA    1396
GER    1305
       ...
CIV       1
BDI       1
SEN       1
DJI       1
GAB       1
Name: count, Length: 147, dtype: int64

In [36]:
medal.Medal.value_counts()

Medal
Gold      10486
Bronze    10369
Silver    10310
Name: count, dtype: int64

In [45]:
medal.Gender.value_counts()

Gender
Men      22746
Women     8419
Name: count, dtype: int64

In [47]:
#### hotdog 데이터에 대한 간단한 정보 확인
hot = pd.read_csv('./data/hotdog.csv')
hot.index = np.arange(1, len(hot.Year)+1)
hot.head()

   Year                        Winner  Dogs eaten        Country  New record
1  1980  Paul Siederman & Joe Baldini         9.1  United States           0
2  1981               Thomas DeBerry         11.0  United States           0
3  1982                Steven Abrams         11.0  United States           0
4  1983                  Luis Llamas         19.5         Mexico           0
5  1984                Birgit Felden          9.5        Germany           0

In [48]:
hot.info()

<class 'pandas.core.frame.DataFrame'>
Index: 31 entries, 1 to 31
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        31 non-null     int64
 1   Winner      31 non-null     object
 2   Dogs eaten  31 non-null     float64
 3   Country     31 non-null     object
 4   New record  31 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 1.5+ KB

In [49]:
hot.Winner.value_counts()

Winner
Takeru Kobayashi                5
Joey Chestnut                   4
Mike DeVito                     3
Jay Green                       2
Frank Dellarosa                 2
Edward Krachie                  2
Hirofumi Nakajima               2
Luis Llamas                     1
Birgit Felden                   1
Oscar Rodriguez                 1
Mark Heller                     1
Don Wolfman                     1
Thomas DeBerry                  1
Steve Keiner                    1
Kazutoyo "The Rabbit" Arai      1
Steven Abrams                   1
Takeru "Tsunami" Kobayashi      1
Paul Siederman & Joe Baldini    1
Name: count, dtype: int64

In [50]:
hot.Country.value_counts()

Country
United States    20
Japan             9
Mexico            1
Germany           1
Name: count, dtype: int64

In [54]:
hot['Dogs eaten'].describe()

count    31.000000
mean     28.991290
std      19.003056
min       9.100000
25%      14.750000
50%      20.000000
75%      49.500000
max      68.000000
Name: Dogs eaten, dtype: float64

## 결측치missing data 처리하기
* null, NaN, NA, None
* 파이썬/pandas에서는 NaN(float:숫자형) 또는 None(object:문자형) 으로 취급
* 단, 정수형 누락값인 NA는 pandas에서는 취급불가
* 결측치는 numpy 모듈을 이용해서 정의해야 함

In [55]:
# 파이썬에서 제공하는 결측치 상수None로 객체 정의
a = np.array([1,2,None,4,5])
print(a, a.dtype)

[1 2 None 4 5] object

In [ ]:
# 결측치가 포함된 객체에 연산 시도
# 오류뜸
# 오류 내용 : unsupported operand type(s) for *: 'NoneType' and 'int'
a * 100

In [ ]:
# 결측치가 포함된 객체에 함수 호출
# 오류뜸
# 오류 내용 : unsupported operand type(s) for +: 'int' and 'NoneType'
a.sum()

In [61]:
# numpy에서 제공하는 결측치 상수NaN로 객체 정의
b = np.array([1,2,np.NaN,4,5])
print(b, b.dtype)

[ 1.  2. nan  4.  5.] float64

In [62]:
# 결측치 제외하고 정상적으로 연산 수행
# numpy에선 결측치 제외하고 처리가 가능함
b * 100

array([100., 200.,  nan, 400., 500.])

In [63]:
# 결측치 때문에 결과가 결측치로 출력
b.sum()

nan

In [65]:
# numpy에서 제공하는 결측치 상수NaN로 Pandas 객체 정의
c = pd.Series([1,2,None,4,5])
print(c, c.dtype)

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
dtype: float64 float64

In [66]:
# 결측치 제외하고 정상적으로 연산 수행
c * 100

0    100.0
1    200.0
2      NaN
3    400.0
4    500.0
dtype: float64

In [67]:
# 결측치 제외하고 정상적으로 연산 수행
c.sum()
# 이렇게 numpy에서 제공하는 결측치 상수를 정의해놓고.. 연산 수행?

12.0

## 결측치 처리하기
* pandas 자료구조에서는 null 값을 감지하고
 삭제하는 기능 제공 
  + isnull, dropna, notnull, fillna

In [68]:
d = pd.Series([1,2,np.NaN,4,None])

In [69]:
# isnull : null 여부를 true/false로 출력
d.isnull()

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [71]:
d.isnull().value_counts()

False    3
True     2
Name: count, dtype: int64

In [74]:
# 결측치가 있는 요소의 인덱스 출력
d[d.isnull()]

2   NaN
4   NaN
dtype: float64

In [72]:
# notnull : null 여부를 true/false로 출력
d.notnull()

0     True
1     True
2    False
3     True
4    False
dtype: bool

In [73]:
d.notnull().value_counts()

True     3
False    2
Name: count, dtype: int64

In [75]:
# dropna : 결측치 제거
d.dropna()

0    1.0
1    2.0
3    4.0
dtype: float64

In [76]:
# fillna : 결측치 대체
d.fillna(0)

0    1.0
1    2.0
2    0.0
3    4.0
4    0.0
dtype: float64

#### emp 데이터에 존재하는 결측치 처리
* 수당의 결측치 : 0.0으로 대체
* 상사번호, 부서번호의 결측치: -로 대체

In [78]:
emp.isnull()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
1,False,False,False,False,False,False,False,False,True,True,False
2,False,False,False,False,False,False,False,False,True,False,False
3,False,False,False,False,False,False,False,False,True,False,False
4,False,False,False,False,False,False,False,False,True,False,False
5,False,False,False,False,False,False,False,False,True,False,False
...,...,...,...,...,...,...,...,...,...,...,...
103,False,False,False,False,False,False,False,False,True,False,False
104,False,False,False,False,False,False,False,False,True,False,False
105,False,False,False,False,False,False,False,False,True,False,False
106,False,False,False,False,False,False,False,False,True,False,False
107,False,False,False,False,False,False,False,False,True,False,False

In [79]:
emp.isnull().value_counts()

EMPLOYEE_ID  FIRST_NAME  LAST_NAME  EMAIL  PHONE_NUMBER  HIRE_DATE  JOB_ID  SALARY  COMMISSION_PCT  MANAGER_ID  DEPARTMENT_ID
False        False       False      False  False         False      False   False   True            False       False            71
                                                                                    False           False       False            34
                                                                                                                True              1
                                                                                    True            True        False             1
Name: count, dtype: int64

In [91]:
emp[['COMMISSION_PCT','MANAGER_ID','DEPARTMENT_ID']].isnull().value_counts()

COMMISSION_PCT  MANAGER_ID  DEPARTMENT_ID
True            False       False            71
False           False       False            34
                            True              1
True            True        False             1
Name: count, dtype: int64

In [92]:
emp.COMMISSION_PCT = emp.COMMISSION_PCT.fillna(0)
emp.COMMISSION_PCT.isnull().value_counts()

COMMISSION_PCT
False    107
Name: count, dtype: int64

In [93]:
emp.MANAGER_ID = emp.MANAGER_ID.fillna('-')
emp.MANAGER_ID.isnull().value_counts()

MANAGER_ID
False    107
Name: count, dtype: int64

In [94]:
emp.DEPARTMENT_ID = emp.DEPARTMENT_ID.fillna('-')
emp.DEPARTMENT_ID.isnull().value_counts()

DEPARTMENT_ID
False    107
Name: count, dtype: int64

In [95]:
emp.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
1,100,Steven,King,SKING,515.123.4567,2003-06-17,AD_PRES,24000.0,0.0,-,90.0
2,101,Neena,Kochhar,NKOCHHAR,515.123.4568,2005-09-21,AD_VP,17000.0,0.0,100.0,90.0
3,102,Lex,De Haan,LDEHAAN,515.123.4569,2001-01-13,AD_VP,17000.0,0.0,100.0,90.0
4,103,Alexander,Hunold,AHUNOLD,590.423.4567,2006-01-03,IT_PROG,9000.0,0.0,102.0,60.0
5,104,Bruce,Ernst,BERNST,590.423.4568,2007-05-21,IT_PROG,6000.0,0.0,103.0,60.0

### 결측치 간단히 삽입하기
* 객체명.fillna({컬럼명:대체값, 컬럼명:대체값, ..., inplace=True})

In [96]:
emp.fillna({'COMMISSION_PCT':0, 'MANAGER_ID':'-', 'DEPARTMENT_ID':'-'}, inplace=True)

### 타이타닉 데이터 결측치 처리
* seaborn 패키지의 titanic 데이터 이용

In [97]:
import seaborn as sns

In [154]:
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [143]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [144]:
titanic[['age','sibsp','parch','fare']].describe()

              age       sibsp       parch        fare
count  714.000000  891.000000  891.000000  891.000000
mean    29.699118    0.523008    0.381594   32.204208
std     14.526497    1.102743    0.806057   49.693429
min      0.420000    0.000000    0.000000    0.000000
25%     20.125000    0.000000    0.000000    7.910400
50%     28.000000    0.000000    0.000000   14.454200
75%     38.000000    1.000000    0.000000   31.000000
max     80.000000    8.000000    6.000000  512.329200

In [150]:
age = titanic.age.median()
titanic.age.fillna(age, inplace=True)
titanic.age.isnull().value_counts()

age
False    891
Name: count, dtype: int64

### 결측치 컬럼 제거
* 객체.drop(대상컬럼, axis=1)

In [155]:
# deck 컬럼은 결측치가 너무 많아서 컬럼 자체를 제거하기
titanic.drop(['deck'], axis=1, inplace=True)
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True

In [156]:
# 결측치 행 제거
titanic.dropna(inplace=True)
titanic.isnull().value_counts()

survived  pclass  sex    age    sibsp  parch  fare   embarked  class  who    adult_male  embark_town  alive  alone
False     False   False  False  False  False  False  False     False  False  False       False        False  False    712
Name: count, dtype: int64

In [157]:
# titanic 객체를 파일로 저장
titanic.to_csv('./data/sns_titanic.csv', index=False)